phynics/axoloty/Embedded/swift/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32c6"

# Enable reproducible builds (deterministic .bin output)
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Swift app tuning. Embedded Swift reserves a ~16 KB temporary-allocation
# workspace per non-inlined function frame, and the smoke/agent entry point
# nests several (app_main plus the generated-corpus runner). The original
# 12 KB main-task stack tripped the hardware stack guard before app_main ran
# its first check; 24 KB and 32 KB still overflowed deeper in the wire/agent
# corpus. 64 KB leaves headroom for the summary/benchmark phases.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_FREERTOS_HZ=1000
CONFIG_HEAP_TRACING_STANDALONE=y

# Single-app layout sized for the production Swift + Wi-Fi/MQTT image.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
